// Завдання 3: Робота з методами масивів (з використанням filter, map та reduce)
// Створіть масив fruits з наступними фруктами: "яблуко", "банан", "апельсин", "груша", "ківі". Використовуючи методи масивів, відсортуйте цей масив за алфавітом у зростаючому порядку та виведіть результат у консоль.
// Перетворіть цей масив у рядок, розділяючи елементи комами, і виведіть цей рядок у консоль.

// Додатково:

// Використайте метод filter, щоб відфільтрувати ті фрукти, які містять більше ніж 5 літер.
// Використайте метод map, щоб створити новий масив, де кожен фрукт буде записаний у верхньому регістрі.
// Використайте метод reduce, щоб об'єднати всі фрукти в один рядок, додавши між ними роздільник -.
// Після кожного кроку виведіть результат у консоль.

let fruits = ["яблуко", "банан", "апельсин", "груша", "ківі"];
console.log(fruits.sort());
console.log(fruits.join(", "));

// Додатково
// 1. Використайте метод filter, щоб відфільтрувати ті фрукти, які містять більше ніж 5 літер.
const result = fruits.filter((fruit) => fruit.length > 5);
console.log(result);

// 2. Використайте метод map, щоб створити новий масив, де кожен фрукт буде записаний у верхньому регістрі.
const toUpperCase = fruits.map((item) => item.toUpperCase(item));
console.log(toUpperCase);

// 3. Використайте метод reduce, щоб об'єднати всі фрукти в один рядок, додавши між ними роздільник -.
const resultReduce = fruits.reduce((accumulator, currentValue) => {
  return accumulator + "-" + currentValue;
});
console.log(resultReduce);
